#### Day 3: Filtering Data with WHERE Clause ðŸŒŸ

Today we focus on filtering records using the WHERE clause.

#### 1. Database Connection

In [1]:
import mysql.connector
import pandas as pd

conn = mysql.connector.connect(
    host="localhost",
    user="root",
    password="",
    database="30_Days_SQL"
)
cursor = conn.cursor()
print("Connected to '30_Days_SQL'!")

Connected to '30_Days_SQL'!

---

#### Practice Exercises ðŸ“˜

#### 1. Retrieve all employees whose age is less than 30

In [2]:
query = "SELECT * FROM employees WHERE age < 30"
pd.read_sql(query, conn)

C:\Users\lenovo\AppData\Local\Temp\ipykernel_17896\3640001058.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql(query, conn)

   employee_id   name  age   salary  department_id  manager_id
0            1   Alan   28  60000.0              1         NaN
1            4  Dylan   25  50000.0              1         2.0

#### 2. Find employees in the Marketing department (ID: 3) or aged 35 and above

In [3]:
query = "SELECT * FROM employees WHERE department_id = 3 OR age >= 35"
pd.read_sql(query, conn)

C:\Users\lenovo\AppData\Local\Temp\ipykernel_17896\4232803724.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql(query, conn)

   employee_id       name  age   salary  department_id  manager_id
0            2      Brian   35  80000.0              3           1
1            3  Catherine   42  90000.0              2           1
2            6      Helen   38  95000.0              3           3

#### 3. Retrieve employees whose names end with the letter 'n'

In [4]:
query = "SELECT * FROM employees WHERE name LIKE '%n'"
pd.read_sql(query, conn)

C:\Users\lenovo\AppData\Local\Temp\ipykernel_17896\511889890.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql(query, conn)

   employee_id   name   age   salary  department_id  manager_id
0            1   Alan  28.0  60000.0              1         NaN
1            2  Brian  35.0  80000.0              3         1.0
2            4  Dylan  25.0  50000.0              1         2.0
3            5   Evan   NaN  70000.0              4         3.0
4            6  Helen  38.0  95000.0              3         3.0

#### 4. List employees who do not belong to the IT department (ID: 1)

In [5]:
query = "SELECT * FROM employees WHERE department_id != 1"
pd.read_sql(query, conn)

C:\Users\lenovo\AppData\Local\Temp\ipykernel_17896\1959630387.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql(query, conn)

   employee_id       name   age   salary  department_id  manager_id
0            2      Brian  35.0  80000.0              3           1
1            3  Catherine  42.0  90000.0              2           1
2            5       Evan   NaN  70000.0              4           3
3            6      Helen  38.0  95000.0              3           3

#### 5. Retrieve employees with non-NULL age values

In [6]:
query = "SELECT * FROM employees WHERE age IS NOT NULL"
pd.read_sql(query, conn)

C:\Users\lenovo\AppData\Local\Temp\ipykernel_17896\4117071628.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql(query, conn)

   employee_id       name  age   salary  department_id  manager_id
0            1       Alan   28  60000.0              1         NaN
1            2      Brian   35  80000.0              3         1.0
2            3  Catherine   42  90000.0              2         1.0
3            4      Dylan   25  50000.0              1         2.0
4            6      Helen   38  95000.0              3         3.0

In [7]:
conn.close()